app/controllers/api/v1/lists_controller.rb

    def create
      @list = List.new(list_params)

      if @list.save
---
INSERT INTO "lists" ("title", "excerpt", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Austin Sunshine"], ["excerpt", "Lakes, State Parks, and Food Trucks"], ["created_at", "2021-05-01 05:10:51.833636"], ["updated_at", "2021-05-01 05:10:51.833636"]]

    def update
      if @list.update(list_params)
---
UPDATE "lists" SET "excerpt" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["excerpt", "Hiding in MoonLight"], ["updated_at", "2021-05-01 06:00:49.270453"], ["id", 4]]